app/views/video/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
		      <td><%= video.video_url %></td>
		      <td><%= Category.find(video.category_id).name %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
		      <% if current_user.user_type == "admin" %>
			      <td><%= User.find(video.user_id).username %></td>