app/views/video/new.html.erb

			<%= f.label :category_id %>
			<%= f.collection_select :category_id, Category.order(:name), :id, :name, include_blank: 'Select Category'%>
---
SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC