app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("plan_code", "no_of_videos", "expiry_in_days", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["plan_code", "ssas"], ["no_of_videos", 3], ["expiry_in_days", 5], ["cost", 6], ["created_at", "2017-07-06 07:40:32.299398"], ["updated_at", "2017-07-06 07:40:32.299398"]]
---
  	def create

		@subscription = Subscription.new(subscription_params)
		# @video =

		@error = @subscription

		if @subscription.save

SELECT  "subscriptions".* FROM "subscriptions"  ORDER BY "subscriptions"."id" ASC LIMIT 5 OFFSET 0
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
	def index
		@subscription = Subscription.order(:id).page(params[:page]).per(5)
		@user = User.find(current_user)

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@subscription = Subscription.find(params[:id])

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "subscriptions" SET "plan_code" = ?, "no_of_videos" = ?, "cost" = ?, "updated_at" = ? WHERE "subscriptions"."id" = ?  [["plan_code", "Diwali"], ["no_of_videos", 4], ["cost", 600], ["updated_at", "2017-07-06 09:29:59.850348"], ["id", 1]]
---
	def update
		@subscription = Subscription.find(params[:id])
		@error = @subscription

		if @subscription.update_attributes(subscription_params)

DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 2]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", 2]]
---
	def destroy
		Subscription.find(params[:id]).destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
UPDATE "users" SET "subscription_id" = ?, "subscription_date" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["subscription_id", 1], ["subscription_date", "2017-07-06 10:18:04.329033"], ["updated_at", "2017-07-06 10:18:04.330550"], ["id", 4]]
---
	def subscribe
		@user = User.find(current_user)
		@user.subscription_id = params[:id]
		@user.subscription_date = Time.now
		if @user.save