app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
		# @users = User.all
		@users = User.order(:id).page(params[:page]).per(5)

INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "username", "address", "city", "country", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		@error = @user
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "username" = ?, "address" = ?, "city" = ?, "country" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", ""], ["last_name", ""], ["username", ""], ["address", ""], ["city", ""], ["country", ""], ["updated_at", "2017-07-06 13:37:15.591139"], ["id", 10]]
---
	def update

		@user = User.find(params[:id])
		@error = @user

		if @user.update_attributes(user_params)