app/controllers/video_category_controller.rb

  	def index
		@category = Category.order(:id).page(params[:page]).per(5)
---
SELECT  "categories".* FROM "categories"  ORDER BY "categories"."id" ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "categories"

	def create
		@category = Category.new(category_params)
		@error = @category
		authorize! :create, @category

		if @category.save
---
INSERT INTO "categories" ("name", "code", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def update
		@category = Category.find(params[:id])
		@error = @category
		authorize! :update, @category

		if @category.update_attributes(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Fitness dfdf"], ["updated_at", "2017-07-04 13:18:37.003890"], ["id", 1]]

	def destroy
		Category.find(params[:id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]