app/controllers/video_controller.rb

INSERT INTO "videos" ("title", "video_url", "category_id", "composer", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create

		@video = current_user.videos.build(video_params)
		# @video = Video.new(video_params)

		@error = @video

		if @video.save

SELECT  "videos".* FROM "videos"  ORDER BY "videos"."id" ASC LIMIT 5 OFFSET 0
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "videos".* FROM "videos" WHERE "videos"."user_id" = ?  ORDER BY "videos"."id" ASC LIMIT 5 OFFSET 0  [["user_id", 4]]
---
	def index
		if current_user.user_type == 'admin'
			@video = Video.order(:id).page(params[:page]).per(5)
		else
			@user = User.find(current_user)
			@video = @user.videos.order(:id).page(params[:page]).per(5)

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@video = Video.find(params[:id])

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "videos" SET "title" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["title", "Intense At Home Pyramid HIIT Workout with Warm Up & Cool Down ddsds"], ["updated_at", "2017-07-05 11:14:40.702181"], ["id", 1]]
---
	def update
		@video = Video.find(params[:id])
		@error = @video

		if @video.update_attributes(video_params)

DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 2]]
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 2]]
---
	def destroy
		Video.find(params[:id]).destroy